Refactor and add workflow and update README
